Q1. List any five functions of the pandas library with execution.

read_csv(): This function is used to read data from a CSV file and create a DataFrame.

In [3]:
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

fillna(): This function is used to fill missing values in a DataFrame with a specified value.

In [6]:
df.fillna("NO")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NO,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NO,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NO,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NO,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NO,1,2,W./C. 6607,23.4500,NO,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NO,Q

drop(): This function is used to remove rows or columns from a DataFrame based on specified labels or index.

In [7]:
df.drop(columns="Parch")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,NaN,Q

merge(): This function is used to combine two DataFrames based on a common column or index.

In [19]:
data1 = pd.DataFrame({
"key1":[1,2,4,5,6],
"key2":[4,5,6,7,8],
"key3":[3,4,5,6,6]        
})

In [20]:
data2 = pd.DataFrame({
"key1":[1,2,45,6,67],
"key4":[56,5,6,7,8],
"key5":[3,56,5,6,6]        
})

In [21]:
pd.merge(data1,data2)

   key1  key2  key3  key4  key5
0     1     4     3    56     3
1     2     5     4     5    56
2     6     8     6     7     6

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [24]:
data = {
"A":[1,2,3,4],
"B":[10,20,30,40],
"C":[100,200,300,40]}

In [25]:
df = pd.DataFrame(data)

In [30]:
df.index = range(1,2*len(df),2)

In [31]:
df

   A   B    C
1  1  10  100
3  2  20  200
5  3  30  300
7  4  40   40

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [32]:
data = {"Values":[10,20,30,40,50,60]}

In [35]:
df=pd.DataFrame(data)

In [43]:
df['Values'].head(3).sum()

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [40]:
df2=pd.DataFrame({'desc':["The Full Stack Data Science course by PWSkills offers a comprehensive curriculum that equips learners with the skills and knowledge to excel in the rapidly evolving field of data science. Through hands-on projects and industry-relevant case studies, students will gain proficiency in every stage of the data science lifecycle. Join us to become a well-rounded data science professional capable of tackling real-world challenges.","My name is Saiprasad","I am a Student"]})

In [41]:
df2['word_count']=df3['desc'].apply(lambda x:len(x.split()))

In [42]:
df2

                                                desc  word_count
0  The Full Stack Data Science course by PWSkills...          63
1                               My name is Saiprasad           4
2                                     I am a Student           4

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size(): This method returns the total number of elements in the DataFrame, which is the product of the number of rows and the number of columns. It counts all the cells in the DataFrame, including those that contain missing or NaN (Not a Number) values.

In [46]:
df2.size

6

DataFrame.shape(): This attribute returns a tuple representing the dimensions of the DataFrame. It provides the number of rows and the number of columns in the DataFrame.

In [47]:
df2.shape

(3, 2)

Q6. Which function of pandas do we use to read an excel file?


In pandas, we use the function pd.read_excel() to read data from an Excel file. This function allows you to read data from both .xls (Excel 97-2003) and .xlsx (Excel 2007 and later) file formats.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [49]:
data = {
    'Email': ['sai.patil@example.com', 'SP.Patil@example.com', 'MB.patil@example.com']
}

In [51]:
df=pd.DataFrame(data)

In [52]:
df["Username"]= df["Email"].apply(lambda email:email.split('@')[0])

In [53]:
df

                   Email   Username
0  sai.patil@example.com  sai.patil
1   SP.Patil@example.com   SP.Patil
2   MB.patil@example.com   MB.patil

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [137]:
data = {'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]}

In [138]:
df1 = pd.DataFrame(data)

In [139]:
selected_rows = df1[(df1['A'] > 5) & (df1['B'] < 10)]

In [140]:
selcted_row

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [76]:
data1 = {"Values":[10,20,30,40,50,60,70,80]}

In [77]:
df2 = pd.DataFrame(data1)

In [89]:
print("Mean:",df2.mean())
print("Median:",df2.median())
print("Standerd Deviation:",df2.std())

Mean: Values    45.0
dtype: float64
Median: Values    45.0
dtype: float64
Standerd Deviation: Values    24.494897
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [84]:
data = {
    'Sales': [50, 60, 70, 80, 90, 100, 110, 120, 130, 140],
    'Date': pd.date_range(start='2023-07-20', periods=10)
}

In [85]:
df3 = pd.DataFrame(data)

In [87]:
df3['MovingAverage'] = df3['Sales'].rolling(window=7, min_periods=1).mean()

In [88]:
df3

   Sales       Date  MovingAverage
0     50 2023-07-20           50.0
1     60 2023-07-21           55.0
2     70 2023-07-22           60.0
3     80 2023-07-23           65.0
4     90 2023-07-24           70.0
5    100 2023-07-25           75.0
6    110 2023-07-26           80.0
7    120 2023-07-27           90.0
8    130 2023-07-28          100.0
9    140 2023-07-29          110.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [124]:
data3 = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']
}

In [125]:
df3 = pd.DataFrame(data3)

In [126]:
df3['Date'] = pd.to_datetime(df3['Date'])

In [127]:
df3['Weekday'] = df3['Date'].dt.strftime('%A')

In [128]:
df3

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [129]:
df3['Date'] = pd.to_datetime(df3['Date'])

In [130]:
select_rows = df3[(df3['Date'] >= '2023-01-01') & (df3['Date'] <= '2023-01-31')]

In [131]:
select_rows

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is the pandas library itself. Pandas is an open-source data manipulation and analysis library for Python. It provides data structures like Series and DataFrame, along with a wide range of functions to manipulate and analyze data efficiently.

To use pandas in your Python code, you need to import it using the import statement:

In [117]:
import pandas as pd

The as pd part is an alias for the pandas library, which allows you to refer to pandas functions and objects using the shorthand pd. This is a common convention used in the Python community when working with pandas.

Once you import pandas, you can use its functions and data structures to perform various data manipulation, analysis, and transformation tasks. For example, you can create Series and DataFrames, read data from various file formats, perform filtering and grouping operations, calculate statistics, and much more using pandas' built-in functions and methods.